{
    "blogs":[
       {
          "id":"blog1",
          "title":"All about Sustainable Developments Goals (SDGs): The What and the Why!",
          "content":"Disaster. Destruction. Distraught societies. A majority of the population with no access to the most basic resources. When leaders from 190+ countries came together in 2015, they knew they had enough resources. It was just that they were not directed towards the more deserving. It was the end of the 15 years aimed at encompassing the anti-poverty Millenium Development Goals (MDGs), and the situation then called for an ever-ambitious set of goals, one that would eradicate challenges like inequality, poverty and environmental hazards. With the hopes of billions at stake, these leaders envisioned a future. A period of 15 years aimed at challenging these issues, they banked on the evidence from the battle against poverty (one that was cut in half within 15 years). A majority of organizations are working towards this, the United Nations Development Programme (UNDP) has roots in 170+ countries and territories and is currently leading the way in this global movement.\n The achievement of various MDGs varied with different countries and the progress made in each, with significant progress still evident in different areas. The 2030 Agenda for Sustainable Development calls for a worldwide effort towards achieving Sustainable Development Goals (SDGs) over the next 15 years. These are built on the previous 8 MDGs, with an emphasis on fighting issues in both developing and developed countries. This agenda addresses social, economic and environmental dimensions of sustainable development, whilst covering those related to peace, justice and effective institutions.",
          "image":"./../assets/pictures/blog1.png",
          "image_caption":"SDG Goals | Source - UN",
          "author":"Hamza Abubakar Kheruwala",
          "date":"September 16, 2020"
       },
       {
         "id":"blog2",
         "title":"An Analysis of data-driven companies online",
         "content":"Delving deeper into my Data Science journey, I have realized that apart from technical analytical skills (ML, Data Analysis), data-driven companies need people with strong interpretation and business analytical skills alike. With basic knowledge, one can do an efficient exploration of data and analysis for better results.\nThe advent of technology has led to big shifts in traditional methods over the last few years. Online shopping has exploded in recent times and will continue to grow exponentially. Businesses are shifting to the internet in search of better growth and opportunities. However, the presence of a huge market over the net has opened up a fierce competition wherein players have to be good enough to mark their presence. The dynamics of the internet are complex and uncertain; however, a strategic approach through the addressal of necessary objectives will help the business grow online. Some companies have a big shift towards embracing the big data culture through data scientists and a variety of software development efforts. In this article, there are a few factors that will help evaluate and strengthen a typical business over the internet.\nThrough a creative and innovative approach to design and development, the web platform should adhere to the user’s environment based on their device, software and other features. There should be a minimal loading time of two seconds or less. Users abandon the website after a waiting time of more than 3 seconds. In case there is high traffic in the pipeline, one must adopt content delivery networks for edge caching. In addition to this, direct purchases will help build the brand and smooth workflow. These can be in the form of lower costs, direct control over the process and direct feedback from the consumers.",
         "image":"./../assets/pictures/blog2.jpg",
          "image_caption":"Design | Source: Infront",
          "author":"Hamza Abubakar Kheruwala",
          "date":"July 13, 2020"
      },
      {
         "id":"blog3",
         "title":"Chai vs Coffee: A Battle of Rivals!",
         "content":"Both of these are wildly popular around the world and are taken with breakfast meals, although after preparation in different ways to suit preferred tastes. Some people prefer tea with milk, while others like it with a hint of honey and lemon. Similarly, some need dark espresso shots to get themselves going for long periods, while some prefer their coffee sweet with a sugary taste. Such is the love and passion for these drinks, that no one would trade them for anything else in the world. To take an example, tea in India is more than a necessity: Different flavors are brewed in as per the regional taste, and people prefer a number of drinks over the course of the day.\nWhile the tons of varieties in chai and coffee have their own sets of benefits to offer, everyone resorts to having their favorite cup at the end of the day. However, the choice may just vary as per the need and the situation. For instance, a hectic morning routine and coffee is the immediate choice.\nStarting with a widely known fact, chai the most popular beverage in the world after water. However, consumption and favoritism do vary for different regions around the world, owing to the taste and regional preferences. It is obvious from the statistics above that most countries in the east prefer tea, while those in the west are fans of coffee. This is chiefly due to the social and cultural differences making up for the preferences of people in these places.",
         "image":"./../assets/pictures/blog3.jpg",
          "image_caption":"Source: OnTrackRetreats",
          "author":"Hamza Abubakar Kheruwala",
          "date":"July 7, 2020"
      },
      {
         "id":"blog4",
         "title":"Chai: How does it vary all over India?",
         "content":"The birthplace of “Chai”: India is nothing less than a haven for enthusiasts all over the world. Through a range of fascinating flavors (each with its own aroma), it makes up for a highly desired beverage by tea connoisseurs from different parts of the world. In this piece, we go through some of the most sought-after varieties from different parts of the country.\nCombine some of your favorite Indian spices such as ginger, cloves, cinnamon and herbs to your everyday tea, and there you go! It is made in different flavors to suit everyone’s liking but in the end, a cup of any masala chai with a plate of snacks makes up for the perfect meal at any time of the day! It is the go-to drink for Indians on a regular basis and is known to prevent fatigue and fight inflammation as part of its health benefits.\nAn out-of-the-box concept from Pune, Tandoori Chai has been making rounds as the new boss in the market. Pre-heated chai containers called kulhads are used to serve chai with a hint of the smoky flavor. Sweet milky tea is poured in the hot earthen clay cups until it sizzles and froths over. The earthy notes combined with sweet caramelization from the sugar make up for the unique taste of this version of tea. If not the taste, the process does make for an entertaining show for the audience.",
         "image":"./../assets/pictures/blog4.jpg",
          "image_caption":"Source: Alamy",
          "author":"Hamza Abubakar Kheruwala",
          "date":"July 1, 2020"
      },
      {
         "id":"blog5",
         "title":"Chai and Regional Preferences",
         "content":"Chai has widely been tested and loved in different parts of the world now. To be honest, there is no single recipe for this beverage, flavors are changing at every turn the spice concoction largely depends on which region you are in and the predominant spice of that region. The different spices used for flavor in addition to each chaiwala’s secret ratio sets every version of the beverage apart. The Indian diaspora has scattered the love far and wide, where each version of chai has been altered by local flavors and preferences. Speaking of the most commonly used ingredients, we have clove, ginger, black cardamom and black pepper: All of which are known to have healing powers to the mind and soul.\nThis is a place that has its own different versions of chai. From Kolkata, where it’s served in a little clay pot called matka to the west in Mumbai, where cutting chai is Mumbaikar’s go-to drink. In the south, the Kattan chai is predominantly famous, it is a lemon black tea, taken with cardamom. It’s the rainy season, and a cup of Indian chai on one hand, and a savory snack on the other that makes up for the best monsoon treat!\nChai here is a mix from preferences of the different neighbors this place shares. Brewed in a samovar, it is mostly the noon chai or kahwa drank in the beautiful valleys of the region. The novelty here is the green base used in addition to saffron and sliced almonds flavoring. Visitors here can enjoy the noon chai as an accompaniment to traditional loaves of bread in the noon.",
         "image":"./../assets/pictures/blog5.png",
          "image_caption":"Source - Chaika",
          "author":"Hamza Abubakar Kheruwala",
          "date":"June 24, 2020"
      },
      {
         "id":"blog6",
         "title":"A Cupful of Nostalgia",
         "content":"“ It’s 5 AM in the morning. Cold wind is gushing through the empty platforms of Bandra. The atmosphere isn’t entirely clear, yet people are slowly huddling together at a corner Chai Stall. A pleasant scene to watch, I look forward to this every single day! ”\nChai, Initially thought of as an Ayurvedic product, legend dates its origin back to more than 500 years from land, now called India. Here, everyone just seems to love it! Every person has a different Chai story — the evening Chai with colleagues after a long day at work, or a group of friends on their first trek in Kasol, freezing at 4 am, with a cup of hot Chai in their hands, or when the sky is heavy, the wind is blowing, and you hear the sound of lashing rain, and you make a cup of Chai while enjoying and appreciating the life at best. Conversations over Chai with friends and family give rise to the deepest of bonds. Chai is always good to go, anytime, anywhere. For this luxury, who else do we thank than a regular Chaiwala with a unique recipe discovered in the small, crowded alley of the market?\nThe best thing about this beverage is the wide variety of taste it brings with itself and the fact that you can have a different one for every occasion. The Dhaba Chai after a long, tedious journey or the Kadak Cardamom Chai to get you up and kicking for hours of long work, don’t even get us started on more! In fact, it’s not just the taste of it, it also interests people through a variety of serving options. Small glasses (cuttings), plastic cups and soil cups (Kullad): People crave for them depending on the weather. For instance, what better way to gulp your Chai during monsoon than drinking it from a kullad? Well, there’s none! To add to this, having some spicy papdi to add to the flavor? Well, one would die for it!",
         "image":"./../assets/pictures/blog6.jpg",
          "image_caption":"Source - Chaika",
          "author":"Hamza Abubakar Kheruwala",
          "date":"June 18, 2020"
      },
      {
         "id":"blog7",
         "title":"Bio-Hash: A fusion of Biometric Security and Hashing",
         "content":"With the advent of technology, almost every aspect of digital processing and computation has evolved. The industry is constantly in terms of providing safe access to protected data of any form. A lot of efforts have been pooled towards securing large volumes of increasing data over the years. These are made in opposition to the attempts made by hackers to break into such security mechanisms. For instance, the Office of Personnel Management (US) alone reported a total of 5.6 million fingerprints stolen by hackers. To combat these, traditional practices like password authentication have evolved into more secure means, such as biometric security in lieu of increasing attempts to breaking such barriers.\nThe password taken from the user is fed as a key to the Randomized Number Generator (Blum Blum Shub Generator). Here, two primes are first generated using the Sieve of Eratosthenes algorithm. The generated random numbers are then sorted in a matrix of order m*n (m vectors, each of n dimensions) by taking the bit parity. Following this, Gram-Schmidt Orthogonalization gives all vectors a unit magnitude and makes them orthogonal to each other.\nOnce we have the required inputs, we perform segmentation and normalization. A scalar product between the two gives us the required Biohash code in the form of orthonormal vectors.",
         "image":"./../assets/pictures/blog7.jpg",
          "image_caption":"Source: projecttimes.com",
          "author":"Hamza Abubakar Kheruwala",
          "date":"May 8, 2020"
      },
      {
         "id":"blog8",
         "title":"Role of Technology in the Fight against COVID-19",
         "content":"Coronavirus (COVID-19) has had the world on the back foot for months now. In fact, the most developed countries are those who have taken a big beating, both in terms of revenue and human life. At a time like this, one would love to quote the movie series “Pacific Rim”, where everyone puts aside all their fights and differences to join hands against something that would be a threat to their very existence. This is a completely different scenario, one would deem this the only way possible out of this global crisis. And guess what? The greatest asset known to humankind, Technology pops right up! Something that people all around the world bank on, there are countless ways it has, currently is and promises to battle the pandemic endangering the lives of different species. Through an unprecedented deployment of resources; scientific and technology communities have put up full efforts to help mitigate the effects caused by the spread of the virus worldwide.\nThe worst impact of this novel coronavirus is probably on the global and national economies. Markets are crashing down, and many companies are facing huge losses. With over half the world’s population in some type of lock-down, employees are unable to go to their workplaces, schools and colleges shut down, and people are even losing their jobs (internships too). But a new phrase has gained momentum due to this — WORK FROM HOME! And this has been made possible because of technology.\nThanks to video conferencing applications like Zoom, Skype, Google Meets, etc. (latest trendsetter being Houseparty!), not all work remains paused during these hard times. Employees are continuing their projects from their homes, with all discussions and meetings online, while many schools/colleges have switched to online classes and exams. It is particularly notable that some companies are profiting from these changes. The sales of laptops have surged recently, while the video conference apps (and surprisingly, Ludo!) have seen exponential growth, and electricity demand has risen.",
         "image":"./../assets/pictures/blog8.jpg",
          "image_caption":"Source: IEEE Spectrum",
          "author":"Hamza Abubakar Kheruwala",
          "date":"April 14, 2020"
      },
      {
         "id":"blog9",
         "title":"AI: A sneak peek",
         "content":"People just going about their daily work, completely on their own, not aided by anyone. Life was quite simpler back then, eh? Well, technology had something else planned for the future. Who would’ve thought machines would totally replace people, let alone aid them in their daily work? The world has come a long way since then. The evolution of technology has actually changed a lot about the world and how people perceive things around them.\nThis was just a taste of the general change. Coming to the most important topic of discussion: AI, short for Artificial Intelligence. While laymen confine their thinking to considering it part of machines those who resemble the functions of a human being, things are a lot different actually. Everywhere, everything around us today is related to this technology in one way or the other. It is just that some things seem to miss the eyes of a common man. In fact, the fact that AI has revolutionized every industry today seems to be just right, no other one has taken a part in the change as much as this technology has. Be it the simplest of traffic management systems to the operation of space crafts, AI has proved its importance and worth to one and all.\nSo much pondered upon this topic, it is actually something that deserves some good attention. Everything today has been developed using this technology, or is being developed with the same. The fact that the existence of a such a “being” that would think and execute like human beings, seems much feasible and attractive to many. While we are prone to faults and errors, using this system makes the work much easier and trusted. Every time it is used to do something, it learns and gets better. Goes and goes hard after it until it becomes better at the job in a way no one can beat it.",
         "image":"./../assets/pictures/blog9.jpg",
          "image_caption":"Source - Web",
          "author":"Hamza Abubakar Kheruwala",
          "date":"November 16, 2019"
      },
      {
         "id":"blog10",
         "title":"Evolution of Convolutional Neural Network Architectures",
         "content":"AI has been gathering tremendous support lately for bridging the gap between humans and machines. Amazing discoveries in numerous fields are paving way for state-of-the-art technologies. One such field where we have seen tremendous improvement is that of Computer Vision. Deep Learning has been a player in this field with numerous improvements over time through the use of one particular model-Convolutional Neural Networks(CNNs).\nThe architecture of CNNs was inspired by the organizational of the Visual Cortex of the human brain. It is essentially a Deep Learning model that takes images, assigns respective weights for differentiation from one another, and does any given task such as image classification. Compared to hard-coded primitive approaches, these can be trained to learn the required filters on enough training. Over the years, there have been a number of developments in architectures to handle problems in regards to computational efficiency, error rate, and further improvements in the domain.\nThat’s the gist of the amazing science behind CNNs and how their architectures have evolved over time, and what are researchers trying to work on. Nowadays, computer vision tasks have hundreds of millions of parameters to train, which makes it a very extensive task. New architectures are coming up all the time and the old architectures are being worked upon to improve their accuracies and computation time. Let’s see which model becomes the next ground-breaking model in the upcoming years!",
         "image":"./../assets/pictures/blog10.jpg",
          "image_caption":"Convolutional Neural networks: An architectural overview | Source - Web",
          "author":"Aaryan Gupta",
          "date":"May 17, 2020"
      }

    ]
 }  
